Documents/ДлительностьЭтаповДляВнешнегоПользователя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ДлительностьЭтаповДляВнешнегоПользователя</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПодписьВедущийКонструктор</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПодписьДизайнер</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПодписьМенеджер</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПодписьНачальникаМонтажа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПодписьНачальникаПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписьВедущийКонструктор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписьДизанер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписьМенеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписьНачальникаМонтажа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписьНачальникаПроизводства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Комплекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Комплект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Композиции</v8:Type>
								<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПродолжительностьМонтажа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПродолжительностьПроектирования</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПродолжительностьРКД</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПродолжительностьСогласования</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПродолжительностьТЗ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ДанныеКомплекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДанныеКомплекта</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаНачалоМонтажа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаНачалоПроектирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаНачалоПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаНачалоРКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаНачалоСогласования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаНачалоТЗ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаОкончаниеМонтажа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаОкончаниеПроектирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаОкончаниеПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаОкончаниеРКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаОкончаниеСогласования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаОкончаниеТЗ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяПродолжительностьПроизводства</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Конструктор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Приоритеты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекущаяСтадия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтадииКомплекта</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Комплект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Композиции</v8:Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ДлительностьЭтаповДляВнешнегоПользователя/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Перем МассивКолонокДляКомпозиции, ЗапретРедактированияПоля;

Процедура ЗаполнитьНаСервере()
	
	мУдалениеСтрок = Новый Массив;

	тзВременная 	= Объект.Комплекты.Выгрузить();
	тзДатыПроекта 	= омГантНаСервере.ПолучитьДатыПроекта(Объект.Проект, , Ложь);
	
	Для каждого СтрокаВременная Из тзВременная Цикл
		
		НайденаяСтрока = тзДатыПроекта.Найти(СтрокаВременная.Комплект, "Комплект");
		
		Если НайденаяСтрока = Неопределено Тогда
			мУдалениеСтрок.Добавить(СтрокаВременная);	
		КонецЕсли;
		
	КонецЦикла;
	
	Для каждого х Из мУдалениеСтрок Цикл
		тзВременная.Удалить(х);		
	КонецЦикла;
	
	мДобавлениеКомплектов = Новый Массив;
	
	Для каждого СтрокаДанных Из тзДатыПроекта Цикл
		
		НайденаяСтрока = тзВременная.Найти(СтрокаДанных.Комплект, "Комплект");
		
		Если НайденаяСтрока = Неопределено Тогда
			мДобавлениеКомплектов.Добавить(СтрокаДанных.Комплект);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаДанных.Композиция) Тогда
			НайденаяСтрока = тзВременная.Найти(СтрокаДанных.Композиция, "Комплект");
			
			Если НайденаяСтрока = Неопределено Тогда
				мДобавлениеКомплектов.Добавить(СтрокаДанных.Композиция);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для каждого СтрокаДанных Из мДобавлениеКомплектов Цикл
		
		НС = тзВременная.Добавить();
		НС.Комплект = СтрокаДанных;
		
	КонецЦикла;
			
	
	тзВременная.Сортировать("Комплект"); 
	
	Объект.Комплекты.Загрузить(тзВременная); 
	
	ВывестиНаСервере();
	
КонецПроцедуры 


&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВидимостьЭлементов()
	Элементы.ДеревоКомплектовЗаполнить.Доступность = ЗначениеЗаполнено(Объект.Проект);	
КонецПроцедуры // ВидимостьЭлементов()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВидимостьЭлементов();
	
	ЗапретРедактированияПоля = Ложь;
	
	МассивКолонокДляКомпозиции = Новый Массив(3);
	МассивКолонокДляКомпозиции[0] = "ДеревоКомплектовПродолжительностьТЗ";
	МассивКолонокДляКомпозиции[1] = "ДеревоКомплектовПродолжительностьПроектирования";
	МассивКолонокДляКомпозиции[2] = "ДеревоКомплектовПродолжительностьСогласования";
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписьВедущийКонструкторПриИзменении(Элемент)
	
	
	
	Для каждого х Из Объект.Комплекты Цикл
	
	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	омЗаполнениеРеквизиов.ЗаполнитьРеквизитыСтандартные(Объект);
	
	Если НЕ (РольДоступна("ПолныеПрава") ИЛИ РольДоступна("Менеджер")) Тогда
		
		Если ЗначениеЗаполнено(Объект.ПодписьМенеджер) Тогда 
			
			ЭтаФорма.ТолькоПросмотр = Истина;
			
		Иначе	
			
			Если НЕ РольДоступна("ГлавныйКонструктор") Тогда
				
				Элементы.ПодписатьВедущийКонструктор.Доступность 	= Ложь;	
				
				Элементы.ДеревоКомплектовПродолжительностьПроектирования.ТолькоПросмотр	= Истина;
				Элементы.ДеревоКомплектовПродолжительностьРКД.ТолькоПросмотр			= Истина;
				
			КонецЕсли;
			
			Если НЕ РольДоступна("Менеджер") Тогда
				
				Элементы.ПодписатьМенеджер.Доступность 	= Ложь;	
				
				Элементы.ДеревоКомплектовПродолжительностьСогласования.ТолькоПросмотр	= Истина;
				
			КонецЕсли;
			
			Если НЕ РольДоступна("НачальникПроизводства") Тогда
				
				Элементы.ПодписатьНачальникПроизводства.Доступность = Ложь;	
				
				Элементы.ДеревоКомплектовПродолжительностьПроизводства.ТолькоПросмотр	= Истина;
				
			КонецЕсли;
			
			Если НЕ РольДоступна("НачальникМонтажа") Тогда
				
				Элементы.ПодписатьНачальникМонтажа.Доступность = Ложь;	
				
				Элементы.ДеревоКомплектовПродолжительностьМонтажа.ТолькоПросмотр	= Истина;
				
			КонецЕсли;
			
			Если НЕ РольДоступна("Дизайнер") Тогда
				
				Элементы.ПодписатьДизайнера.Доступность = Ложь;	
				
				Элементы.ДеревоКомплектовПродолжительностьТЗ.ТолькоПросмотр	= Истина;   
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ВывестиНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораПроекта()
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора",				Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор",		Ложь);
	ПараметрыФормы.Вставить("НеПоказыватьСделки",		Истина);
	ПараметрыФормы.Вставить("МассивПроектовПоказывать",	ПолучитьМассивПроектовОжидания());

	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыборкаПроекта", ЭтаФорма);
	
	ОткрытьФорму("Справочник.Проекты.ФормаВыбора",ПараметрыФормы,ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры // ОткрытьФормуВыбораПроекта()

&НаКлиенте
Процедура ПослеВыборкаПроекта(Значение, ДополнительныйПараметр) Экспорт

	
	Если Значение = Неопределено Тогда  ///Если ничего не выбрать - вернется пустое значение (Неопределено)
		
		Элементы.КомплектыЗаполнить.Доступность = ЗначениеЗаполнено(Объект.Проект);	
		
		Возврат;
	КонецЕсли;
	
	Объект.Проект = Значение;
	Объект.Комплекты.Очистить();
	ДеревоКомплектов.ПолучитьЭлементы().Очистить();
	
	Элементы.ДеревоКомплектовЗаполнить.Доступность = ЗначениеЗаполнено(Объект.Проект);	
	
	ЗаполнитьНаСервере();
	
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ПолучитьМассивПроектовОжидания()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Проекты.Ссылка КАК Проект
		|ИЗ
		|	Справочник.Проекты КАК Проекты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ДлительностьЭтаповДляВнешнегоПользователя КАК ДлительностьЭтаповДляВнешнегоПользователя
		|		ПО (ДлительностьЭтаповДляВнешнегоПользователя.Проект = Проекты.Ссылка)
		|ГДЕ
		|	НЕ Проекты.ПометкаУдаления
		|	И ДлительностьЭтаповДляВнешнегоПользователя.Ссылка ЕСТЬ NULL";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Проект");
	

КонецФункции // ПолучитьМассивПроектовОжидания()

&НаКлиенте
Процедура ПроектНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь; 
	
	Если ДеревоКомплектов.ПолучитьЭлементы().Количество() = 0 Тогда 
		ОткрытьФормуВыбораПроекта();
	Иначе
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВопросаОСменеПроекта",ЭтаФорма);
		ПоказатьВопрос(ОписаниеОповещения,"При смене Проекта будет очищена табличная часть. Продолжить?", РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли; 
	
КонецПроцедуры 

&НаКлиенте
Процедура ПослеВопросаОСменеПроекта(Результат, ДополнительныйПараметр) Экспорт
	
	Если Результат = КодВозвратаДиалога.ДА Тогда
        ОткрытьФормуВыбораПроекта();
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ПодписатьДизайнера(Команда)
	
	Объект.ДатаПодписьДизайнер 	= ТекущаяДата();
	Объект.ПодписьДизанер 		= ПолучитьТекущегоПользователя();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписатьВедущийКонструктор(Команда)
	
	Объект.ДатаПодписьВедущийКонструктор 	= ТекущаяДата();
	Объект.ПодписьВедущийКонструктор 		= ПолучитьТекущегоПользователя();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписатьМенеджер(Команда)
	
	Объект.ДатаПодписьМенеджер 	= ТекущаяДата();
	Объект.ПодписьМенеджер 		= ПолучитьТекущегоПользователя();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписатьНачальникПроизводства(Команда)
	
	Объект.ДатаПодписьНачальникаПроизводства 	= ТекущаяДата();
	Объект.ПодписьНачальникаПроизводства 		= ПолучитьТекущегоПользователя();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписатьНачальникМонтажа(Команда)
	
	Объект.ДатаПодписьНачальникаМонтажа 	= ТекущаяДата();
	Объект.ПодписьНачальникаМонтажа 		= ПолучитьТекущегоПользователя();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТекущегоПользователя()

	Возврат ПараметрыСеанса.ТекущийПользователь;	

КонецФункции // ПолучитьТекущегоПользователя()

&НаКлиенте
Процедура ДеревоКомплектовПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоКомплектовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

Процедура ВывестиНаСервере()

	ДеревоКомплектов.ПолучитьЭлементы().Очистить();
	
	мКомпозиции = Новый Массив;
	мКомплекты 	= Новый Массив;
	
	ТипКомпозиция = Тип("СправочникСсылка.Композиции");
	
	Для каждого СтрокаКомплект Из Объект.Комплекты Цикл
	
		Если ТипЗнч(СтрокаКомплект.Комплект) = ТипКомпозиция  Тогда
			мКомпозиции.Добавить(СтрокаКомплект.Комплект);
		Иначе
			мКомплекты.Добавить(СтрокаКомплект.Комплект);
		КонецЕсли;	
	
	КонецЦикла;       
	
    ДанныеДЗ = РеквизитФормыВЗначение("ДеревоКомплектов");
	
	ОтборКомпозиция = Новый Структура("Композиция", 	);
	ОтборКомплект 	= Новый Структура("Комплект", 	);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИзделияКомплект.Ссылка КАК Комплект,
		|	ИзделияКомплект.Родитель.Композиция КАК Композиция
		|ИЗ
		|	Справочник.ИзделияКомплект КАК ИзделияКомплект
		|ГДЕ
		|	ИзделияКомплект.Родитель.Композиция В(&Композиция)
		|	И НЕ ИзделияКомплект.ЭтоГруппа
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеКомплектаСрезПоследних.Комплект КАК Комплект,
		|	ДанныеКомплектаСрезПоследних.ВнешняяПродолжительностьПроизводства КАК ПродолжительностьПроизводства
		|ИЗ
		|	РегистрСведений.ДанныеКомплекта.СрезПоследних(, Комплект В (&Комплект)) КАК ДанныеКомплектаСрезПоследних";
	
	Запрос.УстановитьПараметр("Композиция", мКомпозиции);
	Запрос.УстановитьПараметр("Комплект", мКомплекты);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ТаблицаСостояний 		= РезультатЗапроса[0].Выгрузить();
	ДлительностиПроизводств = РезультатЗапроса[1].Выгрузить();
	ДлительностиПроизводств.Индексы.Добавить("Комплект");
	
	Для каждого ТекущаяКомпозиция Из мКомпозиции Цикл
	
		ОтборКомпозиция.Композиция 	= ТекущаяКомпозиция;
		ОтборКомплект.Комплект 		= ТекущаяКомпозиция;
		
		СтрокаКомпозиции 			= ДанныеДЗ.Строки.Добавить();
		СтрокаКомпозиции.Комплект 	= ТекущаяКомпозиция;
		
		НайденыеСрокиКомплектов = Объект.Комплекты.НайтиСтроки(ОтборКомплект);
		Если НайденыеСрокиКомплектов.Количество() > 0 Тогда
			СтрокаКомпозиции.ПродолжительностьТЗ 				= НайденыеСрокиКомплектов[0].ПродолжительностьТЗ;	
			СтрокаКомпозиции.ПродолжительностьПроектирования 	= НайденыеСрокиКомплектов[0].ПродолжительностьПроектирования;	
			СтрокаКомпозиции.ПродолжительностьСогласования 		= НайденыеСрокиКомплектов[0].ПродолжительностьСогласования;	
			СтрокаКомпозиции.ПродолжительностьРКД 				= 0;	
			СтрокаКомпозиции.ПродолжительностьПроизводства 		= 0;	
			СтрокаКомпозиции.ПродолжительностьМонтажа 			= 0;	
		КонецЕсли;
		
		НайденыеСроки = ТаблицаСостояний.НайтиСтроки(ОтборКомпозиция);
		Для каждого Комплект Из НайденыеСроки Цикл
		
			СтрокаКомплекта = СтрокаКомпозиции.Строки.Добавить();
			СтрокаКомплекта.Комплект = Комплект.Комплект;
			
			ОтборКомплект.Комплект 	= Комплект.Комплект;
			НайденыеСрокиКомплектов = Объект.Комплекты.НайтиСтроки(ОтборКомплект);
			Если НайденыеСрокиКомплектов.Количество() > 0 Тогда
				СтрокаКомплекта.ПродолжительностьТЗ 				= 0;	
				СтрокаКомплекта.ПродолжительностьСогласования 		= 0;	
				СтрокаКомплекта.ПродолжительностьПроектирования 	= 0;	
				СтрокаКомплекта.ПродолжительностьМонтажа 			= НайденыеСрокиКомплектов[0].ПродолжительностьМонтажа;	
				СтрокаКомплекта.ПродолжительностьРКД 				= НайденыеСрокиКомплектов[0].ПродолжительностьРКД;	
			КонецЕсли; 
			
			НайденыеПроизводство 	= ДлительностиПроизводств.НайтиСтроки(ОтборКомплект);
 			Если НайденыеПроизводство.Количество() > 0 Тогда
				СтрокаКомплекта.ПродолжительностьПроизводства 		= НайденыеПроизводство[0].ПродолжительностьПроизводства;	
			КонецЕсли; 

			НайденоеЗначение = мКомплекты.Найти(Комплект.Комплект);
			Если НЕ НайденоеЗначение = Неопределено Тогда
				мКомплекты.Удалить(НайденоеЗначение);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Для каждого ТекущийКомплект Из мКомплекты Цикл
		
		СтрокаКомплекта 			= ДанныеДЗ.Строки.Добавить();
		СтрокаКомплекта.Комплект 	= ТекущийКомплект;
		ОтборКомплект.Комплект 		= ТекущийКомплект;
		
		НайденыеСрокиКомплектов = Объект.Комплекты.НайтиСтроки(ОтборКомплект);
		Если НайденыеСрокиКомплектов.Количество() > 0 Тогда
			СтрокаКомплекта.ПродолжительностьТЗ 				= НайденыеСрокиКомплектов[0].ПродолжительностьТЗ;	
			СтрокаКомплекта.ПродолжительностьПроектирования 	= НайденыеСрокиКомплектов[0].ПродолжительностьПроектирования;	
			СтрокаКомплекта.ПродолжительностьСогласования 		= НайденыеСрокиКомплектов[0].ПродолжительностьСогласования;	
			СтрокаКомплекта.ПродолжительностьРКД 				= НайденыеСрокиКомплектов[0].ПродолжительностьРКД;	
			СтрокаКомплекта.ПродолжительностьМонтажа 			= НайденыеСрокиКомплектов[0].ПродолжительностьМонтажа;	
		КонецЕсли;
		
		НайденыеПроизводство 	= ДлительностиПроизводств.НайтиСтроки(ОтборКомплект);
		Если НайденыеПроизводство.Количество() > 0 Тогда
			СтрокаКомплекта.ПродолжительностьПроизводства 		= НайденыеПроизводство[0].ПродолжительностьПроизводства;	
		КонецЕсли;
		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ДанныеДЗ, "ДеревоКомплектов");
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.Комплекты.Очистить();
	МассивПроизводства = Новый Массив;
	ТипКомпозиция = Тип("СправочникСсылка.Композиции");
	
	ОбойтиРекурсивноСтрокиДереваНаКлиенте(ДеревоКомплектов.ПолучитьЭлементы(), МассивПроизводства, ТипКомпозиция);
	
	ЗаписатьИзмененияПроизводства(МассивПроизводства);
КонецПроцедуры 

&НаСервереБезКонтекста
Процедура ЗаписатьИзмененияПроизводства(МассивПроизводства)

	МассивКомплектов = Новый Массив;
	
	Для каждого х Из МассивПроизводства Цикл
	
		МассивКомплектов.Добавить(х.Комплект);	
	
	КонецЦикла;
	
	стПараметры = Новый Структура("Комплект, ВнешняяПродолжительностьПроизводства", );
	МенеджерРегистра = РегистрыСведений.ДанныеКомплекта;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеКомплектаСрезПоследних.Комплект КАК Комплект,
		|	ДанныеКомплектаСрезПоследних.ВнешняяПродолжительностьПроизводства КАК ВнешняяПродолжительностьПроизводства
		|ИЗ
		|	РегистрСведений.ДанныеКомплекта.СрезПоследних(, Комплект В (&Комплект)) КАК ДанныеКомплектаСрезПоследних";
	
	Запрос.УстановитьПараметр("Комплект", МассивКомплектов);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		
		НайденоЗначение = Ложь;
		
		ТекущийКомплект = Выборка.Комплект;
		
		Для х = 0 По МассивПроизводства.Количество() - 1 Цикл
		
			Если МассивПроизводства[х].Комплект = ТекущийКомплект Тогда
			
				НайденоЗначение = Истина;
				Если НЕ МассивПроизводства[х].ВнешняяПродолжительностьПроизводства = Выборка.ВнешняяПродолжительностьПроизводства Тогда
				
					стПараметры.Комплект 								= ТекущийКомплект;
					стПараметры.ВнешняяПродолжительностьПроизводства 	= МассивПроизводства[х].ВнешняяПродолжительностьПроизводства;
					
					МенеджерРегистра.ИзменитьДанныеКомплекта(стПараметры);
				
				КонецЕсли;
				
				МассивПроизводства.Удалить(х);
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если НЕ (НайденоЗначение ИЛИ МассивПроизводства[х].ВнешняяПродолжительностьПроизводства = 0)  Тогда
			
			стПараметры.Комплект 								= ТекущийКомплект;
			стПараметры.ВнешняяПродолжительностьПроизводства 	= МассивПроизводства[х].ВнешняяПродолжительностьПроизводства;
			
			МенеджерРегистра.ИзменитьДанныеКомплекта(стПараметры);
			
		КонецЕсли;
		
	КонецЦикла; 
	
	
	Для каждого х Из МассивПроизводства Цикл
		
		стПараметры.Комплект 								= х.Комплект;
		стПараметры.ВнешняяПродолжительностьПроизводства 	= х.ВнешняяПродолжительностьПроизводства;
		
		МенеджерРегистра.ИзменитьДанныеКомплекта(стПараметры);
		
	КонецЦикла;
	
	
КонецПроцедуры // ЗаписатьИзмененияПроизводства()


&НаКлиенте
Процедура ОбойтиРекурсивноСтрокиДереваНаКлиенте(Строки, МассивПроизводства, ТипКомпозиция)
	
	
	Для Каждого СтрокаДерева Из Строки Цикл  
		
		Если НЕ ТипЗнч(СтрокаДерева.Комплект) = ТипКомпозиция Тогда
			
			СтруктураПроизводства = Новый Структура("Комплект, ВнешняяПродолжительностьПроизводства", СтрокаДерева.Комплект,  СтрокаДерева.ПродолжительностьПроизводства);
			МассивПроизводства.Добавить(СтруктураПроизводства);
			
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(Объект.Комплекты.Добавить(), СтрокаДерева);
		
		ПодчиненныеСтроки  = СтрокаДерева.ПолучитьЭлементы();
		
		Если ПодчиненныеСтроки.Количество() > 0 Тогда
			ОбойтиРекурсивноСтрокиДереваНаКлиенте(ПодчиненныеСтроки, МассивПроизводства, ТипКомпозиция);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоКомплектовПередНачаломИзменения(Элемент, Отказ)
	Если Элемент.ТекущийЭлемент.Имя = "ДеревоКомплектовКомплект" Тогда
		Возврат;
	КонецЕсли;

	Если ТипЗнч(Элемент.ТекущиеДанные.Комплект) = Тип("СправочникСсылка.Композиции") Тогда
		Отказ = ?(МассивКолонокДляКомпозиции.Найти(Элемент.ТекущийЭлемент.Имя) = Неопределено, Истина, Ложь);
	ИначеЕсли НЕ ДеревоКомплектов.НайтиПоИдентификатору(Элементы.ДеревоКомплектов.ТекущаяСтрока).ПолучитьРодителя()  = Неопределено Тогда	
		Отказ = ?(МассивКолонокДляКомпозиции.Найти(Элемент.ТекущийЭлемент.Имя) = Неопределено, Ложь, Истина);
	КонецЕсли;
	
	Модифицированность = Модифицированность ИЛИ НЕ Отказ;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоКомплектовПриАктивизацииПоля(Элемент)
	
	Элементы[Элемент.ТекущийЭлемент.Имя].Доступность = Истина; 
	
	Если Элемент.ТекущийЭлемент.Имя = "ДеревоКомплектовКомплект" Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Элемент.ТекущиеДанные.Комплект) = Тип("СправочникСсылка.Композиции") Тогда
		Элементы[Элемент.ТекущийЭлемент.Имя].Доступность =  ?(МассивКолонокДляКомпозиции.Найти(Элемент.ТекущийЭлемент.Имя) = Неопределено, Ложь, Истина);
	ИначеЕсли НЕ ДеревоКомплектов.НайтиПоИдентификатору(Элементы.ДеревоКомплектов.ТекущаяСтрока).ПолучитьРодителя()  = Неопределено Тогда	
		Элементы[Элемент.ТекущийЭлемент.Имя].Доступность =  ?(МассивКолонокДляКомпозиции.Найти(Элемент.ТекущийЭлемент.Имя) = Неопределено, Истина, Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоКомплектовКомплектНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоКомплектовПриАктивизацииСтроки(Элемент)
	
	Элементы.ДеревоКомплектовПродолжительностьТЗ.Доступность 				= Истина;
	Элементы.ДеревоКомплектовПродолжительностьПроектирования.Доступность 	= Истина;
	Элементы.ДеревоКомплектовПродолжительностьСогласования.Доступность 		= Истина;
	Элементы.ДеревоКомплектовПродолжительностьРКД.Доступность 				= Истина;
	Элементы.ДеревоКомплектовПродолжительностьПроизводства.Доступность 		= Истина;
	Элементы.ДеревоКомплектовПродолжительностьМонтажа.Доступность 			= Истина;

КонецПроцедуры
